a, b = input(), input()
if (a == 'красный' or a == 'синий' or a == 'желтый') and (b == 'красный' or b == 'синий' or b == 'желтый'):
    if a == b:
        print(a)
    elif (a == 'красный' or b == 'красный') and (a == 'синий' or b == 'синий'):
        print('фиолетовый')
    elif (a == 'красный' or b == 'красный') and (a == 'желтый' or b == 'желтый'):
        print('оранжевый')
    elif (a == 'синий' or b == 'синий') and (a == 'желтый' or b == 'желтый'):
        print('зеленый')
else:
    print('ошибка цвета')